Autodesk.Revit.DB.Dimension.GenerateDimensionGeometry(Autodesk.Revit.DB.DimensionGeometryOptions)
Generates Dimension geometry that is computed based on the provided input.
Remarks:
A new dimension element will not be added into document.
Use concrete instances of the Autodesk.Revit.DB.DimensionGeometryOptions to produce different types of dimension geometry:
LinearDimensionGeometryOptions for linear dimension.
AngularDimensionGeometryOptions for angular dimension.
RadialDimensionGeometryOptions for radial dimension.
DiameterDimensionGeometryOptions for diameter dimension.
ArcLengthDimensionGeometryOptions for arc length dimension.
options:
The options that will be used to compute the Dimension geometry.
Returns:
Returns Dimension geometry that is computed based on the provided input.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Dimension.HasOneSegment
Determines whether a dimension has one segment.
Since:
2021.1

Autodesk.Revit.DB.Dimension.IsTextPositionAdjustable
Indicates if this dimension is supported to set/get TextPosition/LeaderEndPosition.
Since:
2015 Subscription Update

Autodesk.Revit.DB.Dimension.ResetTextPosition
Resets the text position of the dimension to the initial position determined by its type and parameters.
Remarks:
The initial point is the text position determined by the type and parameters of the dimension.
This property is for use with single-segment dimensions only.
For multi-segment dimensions use the corresponding method of the
DimensionSegment class.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when:
SpotDimension has more than one segments.

Autodesk.Revit.DB.Dimension.TextPosition
The position of the dimension text's drag point.
Remarks:
This property is not applicable to all dimensions.
For example, it is not available for spot slope dimensions, multi-segments dimensions,
dimensions using equality formula, and when dimension style is ordinate.
If the position is not applicable, this property throws InvalidOperationException.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when:
SpotDimension style type is SpotSlope.Using equality formula.Dimension style is ordinate.
-or-
Thrown when:
SpotDimension has more than one segments.
-or-
Since:
2015 Subscription Update

Autodesk.Revit.DB.Dimension.Origin
The dimension origin.
Remarks:
The origin is the middle point of the dimension line that makes up the dimension.
This property is for use with single-segment dimensions only.
For multi-segment dimensions use the corresponding property of the
DimensionSegment class.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when:
SpotDimension has more than one segments.
Since:
2015 Subscription Update

Autodesk.Revit.DB.Dimension.LeaderEndPosition
The position of the dimension's leader end point.
Remarks:
This property is not applicable to all dimensions.
For example, it is not available for spot slope dimensions, multi-segments dimensions,
dimensions using equality formula, and when dimension style is ordinate.
If the position is not applicable, this property throws InvalidOperationException.
Notes for SpotDimension:
This property throws InvalidOperationException if dimension has no leader.Setting of this property works differently for leader with and without shoulder.If leader has shoulder, setting is limited by points on line between leader end and shoulder points (projected point is used).Setting of this property also affects TextPosition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Dimension must have leader.
-or-
Thrown when:
SpotDimension style type is SpotSlope.Using equality formula.Dimension style is ordinate.
-or-
Thrown when:
SpotDimension has more than one segments.
-or-
Since:
2015 Subscription Update

Autodesk.Revit.DB.Dimension.HasLeader
True if dimension has leader, false otherwise.
Since:
2021.1